### Here I am gonna to do some practice basic and important pandas function and attributes

In [1]:
import pandas as pd
import numpy as np

## Attributes and underlying data

In [2]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data=data)

In [3]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

### 1) index

In [4]:
df.index

RangeIndex(start=0, stop=4, step=1)

### 2) columns

In [5]:
df.columns

Index(['Name', 'Age', 'Address', 'Qualification'], dtype='object')

### 3) dtypes

In [6]:
df.dtypes

Name             object
Age               int64
Address          object
Qualification    object
dtype: object

### 4) info

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           4 non-null      object
 1   Age            4 non-null      int64
 2   Address        4 non-null      object
 3   Qualification  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

### 5) values

In [8]:
df.values

array([['Jai', 27, 'Delhi', 'Msc'],
       ['Princi', 24, 'Kanpur', 'MA'],
       ['Gaurav', 22, 'Allahabad', 'MCA'],
       ['Anuj', 32, 'Kannauj', 'Phd']], dtype=object)

### 6) axis

In [9]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['Name', 'Age', 'Address', 'Qualification'], dtype='object')]

### 7) size

In [10]:
df.size

16

### 8) ndim

In [11]:
df.ndim

2

### 9) shape

In [12]:
df.shape

(4, 4)

### 10) memory_useage

In [13]:
df.memory_usage

<bound method DataFrame.memory_usage of      Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd>

### 11) empty

In [14]:
df_empty = pd.DataFrame({'A' : []})

df_empty

Empty DataFrame
Columns: [A]
Index: []

In [15]:
df_empty.empty

True

In [16]:
df2 = pd.DataFrame({'A' : [np.nan]})

df2

    A
0 NaN

In [17]:
df2.dropna().empty

True

### 12) select_dtypes

In [18]:
df3 = pd.read_csv("Dataset/nba.csv")

df3.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

In [19]:
df3.dtypes

Name         object
Team         object
Number        int64
Position     object
Age           int64
Height       object
Weight        int64
College      object
Salary      float64
dtype: object

In [20]:
# Letâ€™s use the dataframe.select_dtypes() function to select all columns having int64 data type in the dataframe.

df3.select_dtypes(include=['int64']).head()

   Number  Age  Weight
0       0   25     180
1      99   25     235
2      30   27     205
3      28   22     185
4       8   29     231

In [21]:
df3.select_dtypes(exclude=['float64']).head()

,Name,Team,Number,Position,Age,Height,Weight,College
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN